app/controllers/access_controller.rb

SELECT "sponsors".* FROM "sponsors"  ORDER BY "sponsors"."name" ASC
---
  def menu
    @sponsors = Sponsor.order(:name)

SELECT  "members".* FROM "members" WHERE "members"."email" = ?  ORDER BY "members"."id" ASC LIMIT 1  [["email", "administrator@administrator.com"]]
---
  def attempt_login
    if params[:email].present? && params[:password].present?
      found_user = Member.where(:email => params[:email]).first