app/controllers/committees_controller.rb

  def index
    @committees = Committee.order(:name)
---
SELECT "committees".* FROM "committees"  ORDER BY "committees"."name" ASC

  def show
    @committee = Committee.find(params[:id])
---
SELECT  "committees".* FROM "committees" WHERE "committees"."id" = ? LIMIT 1  [["id", 1]]

  def create
     @committee = Committee.new(committee_params)

    if @committee.save
---
INSERT INTO "committees" ("name", "image", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Another committee"], ["image", "button_push.png"], ["description", "Just another committee"], ["created_at", "2017-04-04 23:24:40.985541"], ["updated_at", "2017-04-04 23:24:40.985541"]]

  def edit
    @committee = Committee.find(params[:id])
---
SELECT  "committees".* FROM "committees" WHERE "committees"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @committee = Committee.find(params[:id])

    if @committee.update_attributes(committee_params)
---
SELECT  "committees".* FROM "committees" WHERE "committees"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "committees" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "committees"."id" = ?  [["name", "One more committee"], ["description", "Description for one more committee"], ["updated_at", "2017-03-07 01:51:08.611293"], ["id", 3]]

  def delete
    @committee = Committee.find(params[:id])
---
SELECT  "committees".* FROM "committees" WHERE "committees"."id" = ? LIMIT 1  [["id", 7]]

  def destroy
    @committee = Committee.find(params[:id])
    @committee.destroy
---
SELECT  "committees".* FROM "committees" WHERE "committees"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "committees" WHERE "committees"."id" = ?  [["id", 7]]