app/controllers/divisions_controller.rb

SELECT "divisions".* FROM "divisions"  ORDER BY "divisions"."name" ASC
---
  def index
    @divisions = Division.order(:name)

SELECT  "divisions".* FROM "divisions" WHERE "divisions"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
     @division = Division.find(params[:id])

INSERT INTO "divisions" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "wewe"], ["description", "dsfdsd"], ["created_at", "2017-03-14 21:54:57.192855"], ["updated_at", "2017-03-14 21:54:57.192855"]]
---
  def create
     @division = Division.new(division_params)

    if @division.save

SELECT  "divisions".* FROM "divisions" WHERE "divisions"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit
    @division = Division.find(params[:id])

SELECT  "divisions".* FROM "divisions" WHERE "divisions"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "divisions" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "divisions"."id" = ?  [["name", "12121"], ["description", "12121212"], ["updated_at", "2017-03-14 22:42:49.576980"], ["id", 3]]
---
  def update
    @division = Division.find(params[:id])

    if @division.update_attributes(division_params)

SELECT  "divisions".* FROM "divisions" WHERE "divisions"."id" = ? LIMIT 1  [["id", 3]]
---
  def delete
    @division = Division.find(params[:id])

SELECT  "divisions".* FROM "divisions" WHERE "divisions"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "divisions" WHERE "divisions"."id" = ?  [["id", 3]]
---
  def destroy
    @division = Division.find(params[:id])
    @division.destroy