app/controllers/events_controller.rb

  def index
    @events = Event.order(:name)
---
SELECT "events".* FROM "events"  ORDER BY "events"."name" ASC

  def create
     @event = Event.new(event_params)

    if @event.save
---
INSERT INTO "events" ("name", "link_to_event", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ewde"], ["link_to_event", "www.sdsd.com"], ["created_at", "2017-03-14 22:00:14.145237"], ["updated_at", "2017-03-14 22:00:14.145237"]]

  def update
    @event = Event.find(params[:id])

    if @event.update_attributes(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "events" SET "name" = ?, "link_to_event" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["name", "rereere"], ["link_to_event", "www.tgtgtgt.com"], ["updated_at", "2017-03-14 22:43:23.027194"], ["id", 3]]

  def delete
    @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 3]]