app/controllers/members_controller.rb

SELECT "members".* FROM "members"  ORDER BY "members"."name" ASC
---
  def index
    @members = Member.order(:name)

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @member = Member.find(params[:id])

INSERT INTO "members" ("name", "email", "password_digest", "major", "grad_year", "member_since", "hometown", "pro_interests", "position_id", "division_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
     @member = Member.new(member_params)

    if @member.save

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @member = Member.find(params[:id])

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "members" SET "password_digest" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["password_digest", "$2a$10$QBGDVxbCs7FcbSzpjsTV2eO3Zn2j4bnNjurY92.q.a5DQPF3Hr3i6"], ["updated_at", "2017-03-23 01:13:14.386933"], ["id", 1]]
---
  def update
    @member = Member.find(params[:id])

    if @member.update_attributes(member_params)

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 2]]
---
  def delete
    @member = Member.find(params[:id])

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 2]]
---
  def destroy
    @member = Member.find(params[:id])
    @member.destroy