app/controllers/parameters_controller.rb

  def index
    @parameters = Parameter.all
---
SELECT  "parameters".* FROM "parameters"  ORDER BY "parameters"."id" ASC LIMIT 1

  def show
    @parameter = Parameter.find(params[:id])
---
SELECT  "parameters".* FROM "parameters" WHERE "parameters"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @parameter = Parameter.find(params[:id])
---
SELECT  "parameters".* FROM "parameters" WHERE "parameters"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @parameter = Parameter.find(params[:id])

    if @parameter.update_attributes(parameter_params)
---
SELECT  "parameters".* FROM "parameters" WHERE "parameters"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "parameters" SET "main_image_1" = ?, "main_image_1_title" = ?, "main_image_1_subtitle" = ?, "main_image_2" = ?, "main_image_2_title" = ?, "main_image_2_subtitle" = ?, "main_image_3" = ?, "main_image_3_title" = ?, "main_image_3_subtitle" = ?, "main_image_4" = ?, "main_image_4_title" = ?, "main_image_4_subtitle" = ?, "main_image_5" = ?, "main_image_5_title" = ?, "main_image_5_subtitle" = ?, "main_image_6" = ?, "main_image_6_title" = ?, "main_image_6_subtitle" = ?, "about_title" = ?, "about_description" = ?, "committees_title" = ?, "committees_description" = ?, "sponsors_title" = ?, "sponsors_description" = ?, "events_title" = ?, "events_description" = ?, "exboard_title" = ?, "exboard_description" = ?, "excouncil_title" = ?, "excouncil_description" = ?, "login_title" = ?, "members_title" = ?, "members_description" = ?, "members_link" = ?, "members_footer" = ?, "students_title" = ?, "students_description" = ?, "students_link" = ?, "students_footer" = ?, "companies_title" = ?, "companies_description" = ?, "companies_link" = ?, "companies_footer" = ?, "contactus_title" = ?, "contactus_header" = ?, "contactus_address" = ?, "contactus_phone" = ?, "contactus_url" = ?, "calendar_title" = ?, "calendar_description" = ?, "updated_at" = ? WHERE "parameters"."id" = ?