app/controllers/positions_controller.rb

  def index
    @positions = Position.order(:name)
---
SELECT "positions".* FROM "positions"  ORDER BY "positions"."name" ASC

  def show
    @position = Position.find(params[:id])
---
SELECT  "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT 1  [["id", 1]]

  def create
     @position = Position.new(position_params)

    if @position.save
---
INSERT INTO "positions" ("name", "pos_type", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "oioi"], ["pos_type", "bubuunhu"], ["created_at", "2017-03-14 22:06:32.082293"], ["updated_at", "2017-03-14 22:06:32.082293"]]

  def edit
    @position = Position.find(params[:id])
---
SELECT  "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT 1  [["id", 3]]

  def update
    @position = Position.find(params[:id])

    if @position.update_attributes(position_params)
---
SELECT  "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "positions" SET "name" = ?, "pos_type" = ?, "updated_at" = ? WHERE "positions"."id" = ?  [["name", "hnhnhn"], ["pos_type", "hnhnhnhnhnhn"], ["updated_at", "2017-03-14 22:44:24.291157"], ["id", 3]]

  def delete
    @position = Position.find(params[:id])
---
SELECT  "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT 1  [["id", 3]]

  def destroy
    @position = Position.find(params[:id])
    @position.destroy
---
SELECT  "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "positions" WHERE "positions"."id" = ?  [["id", 3]]