app/views/members/edit.html.erb

                <td class="columnLabel">Position</td>
                <td><%= collection_select(:member, :position_id, Position.order(:name), :id, :name, {}, {:multiple => false}) %></td>
---
SELECT "positions".* FROM "positions"  ORDER BY "positions"."name" ASC

                <td class="columnLabel">Division</td>
                <td><%= collection_select(:member, :division_id, Division.order(:name), :id, :name, {}, {:multiple => false}) %></td>
---
SELECT "divisions".* FROM "divisions"  ORDER BY "divisions"."name" ASC