app/views/members/show.html.erb

            <td class="columnLabel boldText">Position:</td>
            <td><%= collection_select(:member, :position_id, Position.order(:name), :id, :name, {}, {:multiple => false, :disabled => "disabled"}) %></td></td>
---
SELECT "positions".* FROM "positions"  ORDER BY "positions"."name" ASC

            <td class="columnLabel boldText">Division:</td>
            <td><%= collection_select(:member, :division_id, Division.order(:name), :id, :name, {}, {:multiple => false, :disabled => "disabled"}) %></td>
---
SELECT "divisions".* FROM "divisions"  ORDER BY "divisions"."name" ASC